Repository: diegomlopes/guideaut
Catalog: lib/l10n/app_*.arb
Languages: pt

# immersion11
source: In this activity, information is extracted from the client about what he wants to be built. It is the moment of conversation with the user, of feeling about what he expects to be delivered. In addition, in this activity, the needs of the system and the characteristics that it must have are perceived. The techniques defined for the Elicit Requirements activity in ProAut are: Interviews and Exploratory Research. In addition, this activity has a sub-activity called Autistic Characterization, which consists of applying the FCA (Autistic Characterization Form), and is carried out during the interview with parents and specialists. The Elicit Requirements activity generates, as artifacts, a set of annotations as well as the completed FCA. These artifacts will serve as input for the next activity (Data Consolidation). Figure 6 presents a diagram that allows a complete view of the Requirements Elicitation activity.
pt: Nessa atividade, são extraídas informações do cliente sobre o que ele deseja que seja construído. É o momento da conversa com o usuário, de sentir o que ele espera que seja entregue. Além disso, nesta atividade, são percebidas as necessidades do sistema e as características que ele deve ter. As técnicas definidas para a atividade Elicitar Requisitos no ProAut são: Entrevistas e Pesquisa Exploratória. Além disso, esta atividade possui uma subatividade denominada Caracterização do Autista, que consiste na aplicação do FCA (Ficha de Caracterização do Autista), e é realizada durante a entrevista com pais e especialistas. A atividade Elicitar Requisitos gera, como artefatos, um conjunto de anotações, bem como o FCA concluído. Esses artefatos servirão de entrada para a próxima atividade (Consolidação de Dados). A Figura 6 apresenta um diagrama que permite uma visão completa da atividade de Elicitação de Requisitos.

# immersion12
source: Interviews
pt: Entrevistas

# immersion13
source: ProAut contemplates 3 types of interviews, namely: interview with the applicant, interview with caregivers and interview with therapists. The interview with the applicant is mandatory, since it is he who will pass on the needs of the software/Application. A list of questions is available for each type of interview. However, the interviewer need not be limited to this script. That is, just as he may feel the need to ask new questions to complement the answers, he may also fail to ask any.
pt: O ProAut contempla 3 tipos de entrevistas, a saber: entrevista com o solicitante, entrevista com cuidadores e entrevista com terapeutas. A entrevista com o solicitante é obrigatória, pois é ele quem irá repassar as necessidades do software/Aplicativo. Uma lista de perguntas está disponível para cada tipo de entrevista. No entanto, o entrevistador não precisa se limitar a esse roteiro. Ou seja, assim como ele pode sentir a necessidade de fazer novas perguntas para complementar as respostas, ele também pode deixar de fazer alguma.

# immersion14
source: Interview with applicant – the first interview must be conducted with the applicant for the application. It should collect information about the purpose of the application, which skills you want to be worked on by the application, as well as the desired requirements and functionalities. The following table presents the list of questions to ask the applicant:
pt: Entrevista com o candidato – a primeira entrevista deve ser realizada com o candidato à candidatura. Ele deve coletar informações sobre o objetivo do aplicativo, quais habilidades você deseja que sejam trabalhadas pelo aplicativo, bem como os requisitos e funcionalidades desejados. A tabela a seguir apresenta a lista de perguntas a serem feitas ao candidato:

# immersion15
source: Interview with Caregivers – the interview with caregivers must be conducted after the interview with the applicant for the application. The reason is that, in possession of the knowledge about the objectives and needs of the application, some questions related to the theme/context of the application are asked. Thus, in this interview, the designer/team should collect information, for example, regarding the social aspects of the autistic, activities that calm/stress, relationship with technologies, among others. The table presents a script to be used for interviewing caregivers:
pt: Entrevista com os Cuidadores – a entrevista com os cuidadores deve ser realizada após a entrevista com o candidato à candidatura. A razão é que, de posse do conhecimento sobre os objetivos e necessidades do aplicativo, são feitas algumas perguntas relacionadas ao tema/contexto do aplicativo. Assim, nesta entrevista, o designer/equipe deverá coletar informações, por exemplo, quanto aos aspectos sociais do autista, atividades que acalmam/estresse, relação com tecnologias, entre outros. A tabela apresenta um roteiro a ser utilizado para entrevistar os cuidadores:

# immersion16
source: Interview with therapists – the interview with specialists should also be carried out after the interview with the applicant, for the same reason given for caregivers. In addition, the selection of some specialists is done according to the objectives and needs of the application. For example: an application aimed at education (literacy, teaching mathematics, vowels, etc.) should consider an interview with a pedagogue specializing in autistic education; an application aimed at helping the verbal development of considering an interview with a speech therapist who specializes in autistic care; and so on. In the interview with specialists, the designer/team should collect information, for example, regarding the social aspects of the autistic, activities that calm/stress, relationship with technologies, among others. The following table presents questions to ask therapists:
pt: Entrevista com terapeutas – a entrevista com especialistas também deve ser realizada após a entrevista com o candidato, pelo mesmo motivo apresentado para os cuidadores. Além disso, a seleção de alguns especialistas é feita de acordo com os objetivos e necessidades da candidatura. Por exemplo: um aplicativo voltado para a educação (alfabetização, ensino de matemática, vogais, etc.) deve contemplar uma entrevista com um pedagogo especializado em educação de autistas; um aplicativo que visa auxiliar o desenvolvimento verbal de considerar uma entrevista com uma fonoaudióloga especializada em atendimento a autistas; e assim por diante. Na entrevista com especialistas, o designer/equipe deve coletar informações, por exemplo, sobre os aspectos sociais do autista, atividades que acalmam/estresse, relação com tecnologias, entre outros. A tabela a seguir apresenta perguntas a serem feitas aos terapeutas:

# immersion17
source: NOTE: If you have difficulties interviewing parents/guardians and/or specialists, the designer/developer can use GuideAut, a repository composed of information about autistic people (in development).
pt: NOTA: Caso tenha dificuldades em entrevistar pais/responsáveis e/ou especialistas, o designer/desenvolvedor pode utilizar o GuideAut, um repositório composto por informações sobre autistas (em desenvolvimento).

# immersion18
source: Suggestion o procedure for the interviews: 1. Make an appointment with the interviewee; 2. For specialists only, the selection should be made according to the area of expertise in relation to the purpose and needs of the software; 3. Define the means to record the interview (audio recording, notebook, filming, etc.); 4. Provide material for recording the interview; 5. Arrive in advance at the interview location; 6. Except for the applicant, explain the objectives and needs of the software as well as the purpose of the interview and present the TCLE (Free and Informed Consent Form) and request its signature (or agreement for the virtual case); 7. Also except for the applicant, explain about filling out the FCA. Since for the specialist, he should respond based on the majority of consultations. For example, in question 25 (walks on tiptoe) the specialist should answer yes (1) if the majority of those assisted have this characteristic; 8. Before using the proposed script, ask and write down the name of the interviewee; 9. Start the interview using the suggested script; 10. Only for parents/guardians/guardians and specialists to apply the FCA.
pt: Sugestões de procedimentos para entrevistas: 1. Marcar consulta com o entrevistado; 2. Apenas para especialistas, a seleção deve ser feita de acordo com a área de atuação em relação à finalidade e necessidade do software; 3. Defina os meios para gravar a entrevista (gravação de áudio, caderno, filmagem, etc.); 4. Fornecer material para gravação da entrevista; 5. Chegue com antecedência ao local da entrevista; 6. Exceto pelo proponente, explicar os objetivos e necessidades do software bem como a finalidade da entrevista e apresentar o TCLE (Termo de Consentimento Livre e Esclarecido) e solicitar sua assinatura (ou concordância para o caso virtual); 7. Além disso, exceto para o requerente, explique sobre o preenchimento do FCA. Já para o especialista, ele deve responder com base na maioria das consultas. Por exemplo, na questão 25 (anda na ponta dos pés) o especialista deve responder sim (1) se a maioria dos atendidos tem essa característica; 8. Antes de utilizar o roteiro proposto, pergunte e anote o nome do entrevistado; 9. Inicie a entrevista usando o roteiro sugerido; 10. Apenas para pais/responsáveis/responsáveis e especialistas para aplicar o FCA.

# immersion19
source: Characterize the Autistic: It consists of applying the FCA, whose information will serve as the basis for Personas techniques, Empathy Map in the Analysis phase. The same should be presented at the beginning of interviews with caregivers and therapists. The FCA is a form divided into 4 sections, representing the 4 main areas of limitation of an autistic person, namely: Interaction, Communication, Behavior and Cognition. Each section is made up of a set of characteristics for which the interviewer must mark the value 1, when the child presents the characteristic, and 0 otherwise. Completing the FCA produces a chart called the Autistic Overview Chart (VGA), which allows you to visualize the degree of impairment in each of the areas. So, the higher the percentage of autistic individuals in a given area, the greater the commitment in that area. The figure below presents an example of the VGA, in which it can be seen that the communication area is the most compromised, followed by the areas of interaction and cognition, both with more than 50% of compromise.
pt: Caracterização do Autista: Consiste na aplicação do FCA, cujas informações servirão de base para técnicas de Personas, Mapa de Empatia na fase de Análise. O mesmo deve ser apresentado no início das entrevistas com cuidadores e terapeutas. O FCA é um formulário dividido em 4 seções, representando as 4 principais áreas de limitação de um autista, a saber: Interação, Comunicação, Comportamento e Cognição. Cada seção é composta por um conjunto de características para as quais o entrevistador deve marcar o valor 1, quando a criança apresenta a característica, e 0, caso contrário. O preenchimento do FCA produz um gráfico chamado Autistic Overview Chart (VGA), que permite visualizar o grau de comprometimento em cada uma das áreas. Assim, quanto maior o percentual de autistas em uma determinada área, maior o comprometimento naquela área. A figura abaixo apresenta um exemplo do VGA, no qual pode-se observar que a área de comunicação é a mais comprometida, seguida pelas áreas de interação e cognição, ambas com mais de 50% de comprometimento.

# immersion20
source: Suggestion of Procedure:
pt: Sugestões de procedimento:

# immersion21
source: 1. Print the FCA (if it is not possible to apply electronically); 2. Before starting the interview with the parents/guardians and talking about the need to complete the FCA; 3. Define whether the FCA will be applied before or after the interview; 4. Start the application of the FCA marking for each characteristic item, the value 1 if the characteristic is present in the child or 0 in case of absence.'
pt: 1. Imprima o FCA (caso não seja possível solicitar eletronicamente); 2. Antes de iniciar a entrevista com os pais/responsáveis e falar sobre a necessidade de preenchimento do FCA; 3. Definir se a FCA será aplicada antes ou depois da entrevista; 4. Iniciar a aplicação da marcação FCA para cada item de característica, valor 1 se a característica estiver presente na criança ou 0 em caso de ausência.

# immersion22
source: It should be noted that the characteristic is considered present if the autistic person presents it even sporadically. On the other hand, he is considered absent if he has never presented himself, or if he presented himself very rarely throughout his life;
pt: Ressalta-se que a característica é considerada presente se o autista a apresenta mesmo que esporadicamente. Por outro lado, é considerado ausente se nunca se apresentou, ou se se apresentou muito raramente ao longo da vida;

# immersion23
source: Exploratory research
pt: Pesquisa exploratória

# immersion24
source: The Exploratory Research is an optional activity, and should be carried out if the designer/team feels the need to deepen the knowledge regarding the daily life of autistic people. The Exploratory Research is done through observation in a real environment that involves an autistic person in relation to the theme of the project. It can be at school, in an office or even at home.
pt: A Pesquisa Exploratória é uma atividade opcional, devendo ser realizada caso o designer/equipe sinta necessidade de aprofundar os conhecimentos sobre o cotidiano das pessoas autistas. A Pesquisa Exploratória é feita através da observação em um ambiente real que envolve uma pessoa autista em relação ao tema do projeto. Pode ser na escola, no escritório ou até mesmo em casa.

# immersion25
source: Remembering that there is no intervention, only observation. This research helps the designer/team not only to come up with good ideas, but also to define and better understand the profile of autistic people. The observer cannot interact with or interfere with the observed scenario (he must be like “a fly on the wall”).
pt: Lembrando que não há intervenção, apenas observação. Esta pesquisa ajuda o designer/equipe não só a ter boas ideias, mas também a definir e entender melhor o perfil dos autistas. O observador não pode interagir ou interferir no cenário observado (deve ser como “uma mosca na parede”).

# immersion26
source: Suggestion of Procedure:
pt: Sugestões de procedimento:

# immersion27
source: 1. Schedule the procedure with a family/specialist/teacher/school, that is, the person responsible for the place where the exploratory research will be carried out; 2. Define the means to record the observation (audio recording, notebook, filming, etc.); 3. Provide material for recording the observation; 4. Arrive early at the venue; 5. Record the child's forms of interaction and behavior in their daily lives;
pt: 1. Agendar o procedimento com um familiar/especialista/professor/escola, ou seja, o responsável pelo local onde será realizada a pesquisa exploratória; 2. Defina os meios para registrar a observação (gravação de áudio, caderno, filmagem, etc.); 3. Fornecer material para registro da observação; 4. Chegue cedo ao local; 5. Registre as formas de interação e comportamento da criança em seu cotidiano;

# immersion28
source: Consolidate Data
pt: Consolidar dados

# immersion29
source: The Consolidate Data activity consists of analyzing the information obtained from the responses to the interviews carried out, and mapping them to the corresponding Canvas. For example, the answers to the interviews carried out with specialists should be analyzed and mapped to the ASC (Autims´s Specialists Canvas), here simplified to the Specialist Canvas, and so on. This step produces the properly completed Canvas as artifacts, along with the FCA(s) and the respective VGA(s). The following figure presents each type of interview associated with its respective Canvas.
pt: A atividade Consolidar Dados consiste em analisar as informações obtidas a partir das respostas às entrevistas realizadas e mapeá-las para o Canvas correspondente. Por exemplo, as respostas das entrevistas realizadas com especialistas devem ser analisadas e mapeadas para o ASC (Autims Specialists Canvas), aqui simplificado para o Specialist Canvas, e assim sucessivamente. Esta etapa produz o Canvas devidamente preenchido como artefatos, junto com o(s) FCA(s) e o(s) respectivo(s) VGA(s). A figura a seguir apresenta cada tipo de entrevista associada ao seu respectivo Canvas.

# immersion30
source: Mapping of interviews to the corresponding Canvas
pt: Mapeamento das entrevistas para o Canvas correspondente

# immersion31
source: Mapping the customer interview script to the CCS
pt: Mapeando o roteiro de entrevista do cliente para o CCS

# immersion32
source: The mapping of questions asked to the requester to the Requesters Canvas is shown in the following figure. Each question must be mapped according to the numbers presented in the respective Figure. For example, questions 1, 2 and 3 should be mapped to section 1 (Profile) of the canvas, question 4 to section 2, question 5 to 3 and so on.
pt: O mapeamento das perguntas feitas ao solicitante para o Requesters Canvas é mostrado na figura a seguir. Cada questão deve ser mapeada de acordo com os números apresentados na respectiva Figura. Por exemplo, as questões 1, 2 e 3 devem ser mapeadas para a seção 1 (Perfil) do canvas, a questão 4 para a seção 2, a questão 5 para a 3 e assim por diante.

# immersion33
source: Most of the questions will have to be mapped through the analysis and extraction of relevant information obtained in the interview, and can be presented in the form of topics or textually.
pt: A maioria das perguntas terá que ser mapeada por meio da análise e extração de informações relevantes obtidas na entrevista, podendo ser apresentadas na forma de tópicos ou textualmente.

# immersion34
source: Mapping of the caregivers interview script for the CCA
pt: Mapeamento do roteiro de entrevista dos cuidadores para o CCA

# immersion35
source: The mapping of the questions asked to the parents/guardians/guardians to the corresponding canvas is shown in Figure 10. As in the ARC, the APC can also be completed both in the form of topics and textually, and each question must be mapped in the section according to the numbers shown in figure.
pt: O mapeamento das perguntas feitas aos pais/responsáveis/responsáveis para a tela correspondente é apresentado na Figura 10. Assim como no ARC, o APC também pode ser preenchido tanto na forma de tópicos quanto textualmente, devendo cada pergunta ser mapeada em a seção de acordo com os números mostrados na figura.

# immersion36
source: For the Profile section, some remarks:
pt: Para a seção Perfil, algumas observações:

# immersion37
source: Question 1: With the ages obtained in each interview with the parents/guardians, define the age range, taking the lowest age as the lower limit and the highest age as the upper limit. For example, if the ages obtained were 6, 8, 10, and 5 years old, the defined age range will be 5 to 10 years old;
pt: Questão 1: Com as idades obtidas em cada entrevista com os pais/responsáveis, defina a faixa etária, tomando a menor idade como limite inferior e a maior idade como limite superior. Por exemplo, se as idades obtidas forem 6, 8, 10 e 5 anos, a faixa etária definida será de 5 a 10 anos;

# immersion38
source: Question 2: State the type of communication: verbal, non-verbal or echolalic verbal (that is, summarize in one of these classifications);
pt: Questão 2: Informar o tipo de comunicação: verbal, não verbal ou verbal ecolálica (ou seja, resumir em uma dessas classificações);

# immersion39
source: Question 3: Depending on the number of respondents, create an interval with the different series obtained. For example: in the item attending school, if the majority is yes, put the grade interval on the canvas. For example, if a child attends the 3rd, another 4th and another 5th of elementary school, then on the canvas you should put from 3rd to 5th grade of elementary school. If the majority does not attend school, insert “does not attend school” on the canvas;
pt: Questão 3: Dependendo do número de respondentes, crie um intervalo com as diferentes séries obtidas. Por exemplo: no item frequentar a escola, se a maioria for sim, coloque na tela o intervalo de notas. Por exemplo, se uma criança cursa o 3º, outro 4º e outro 5º do ensino fundamental, então na tela você deve colocar do 3º ao 5º ano do ensino fundamental. Se a maioria não frequenta escola, inserir “não frequenta escola” na tela;

# immersion40
source: Question 4: take the different answers and check the one that appears the most. For example, if 2 children live with their parents, 1 with their mother and 1 with their grandmother, transcribe “lives with their parents” onto Canvas, as it represents the majority;
pt: Questão 4: pegue as diferentes respostas e marque a que mais aparece. Por exemplo, se 2 filhos moram com os pais, 1 com a mãe e 1 com a avó, transcreva “mora com os pais” no Canvas, pois representa a maioria;

# immersion41
source: Questions 6 and 7 – Depending on the quantity, put the majority answer. For example: in the item attending school, if the majority is yes, put it.
pt: Questões 6 e 7 – Dependendo da quantidade, coloque a resposta majoritária. Por exemplo: no item frequentar a escola, se a maioria for sim, coloque.

# immersion42
source: For the other sections, analyze each response and extract the most relevant information, and map it to the corresponding section, as shown in the figure below.
pt: Para as demais seções, analise cada resposta e extraia as informações mais relevantes, e mapeie para a seção correspondente, conforme a figura abaixo.

# immersion43
source: Mapping of the experts interview script for the ASC (Autism's Specialists Canvas)
pt: Mapeamento do roteiro de entrevista dos especialistas para o ASC (Autism's Specialists Canvas)

# immersion44
source: The mapping of questions asked to experts to the corresponding canvas is shown in the following figure. As with the previous mappings, each question must be mapped in the section according to the numbers presented. For example, questions 1, 2 and 3 for section 1 (Profile) of the ASC, question 4 for section 2 (stereotypies/manias) and so on.
pt: O mapeamento das perguntas feitas aos especialistas para o canvas correspondente é mostrado na figura a seguir. Assim como nos mapeamentos anteriores, cada questão deve ser mapeada na seção de acordo com os números apresentados. Por exemplo, questões 1, 2 e 3 para a seção 1 (Perfil) do ASC, questão 4 para a seção 2 (estereotipias/manias) e assim por diante.

# immersion45
source: For the Profile section, some remarks:
pt: Para a seção Perfil, algumas observações:

# immersion46
source: Question 1: With the ages obtained in each interview, define the age range, taking the lowest age as the lower limit and the highest as the upper limit. For example, if the ages obtained were 6, 8, 10, and 5, the defined age range will be 5 to 10 years old;
pt: Questão 1: Com as idades obtidas em cada entrevista, defina a faixa etária, tomando a menor idade como limite inferior e a maior como limite superior. Por exemplo, se as idades obtidas forem 6, 8, 10 e 5, a faixa etária definida será de 5 a 10 anos;

# immersion47
source: Question 2: State the type of communication: verbal, non-verbal or echolalic verbal.
pt: Questão 2: Indique o tipo de comunicação: verbal, não verbal ou verbal ecolálica.
