Repository: diegomlopes/guideaut
Catalog: lib/l10n/app_*.arb
Languages: pt

# analysis25
source: 1. If the designer/developer has opted for a single FCA, this will also generate a single VGA; 2. If the designer/developer has chosen several FCAs, then each one must be transcribed into electronic form and, consequently, generate 1 VGA for each FCA.
pt: 1. Caso o designer/desenvolvedor tenha optado por um único FCA, este também gerará um único VGA; 2. Caso o projetista/desenvolvedor tenha escolhido vários FCAs, então cada um deve ser transcrito em formato eletrônico e, consequentemente, gerar 1 VGA para cada FCA.

# ideation1
source: Overview
pt: Visão geral

# ideation2
source: Description: This phase aims to generate ideas through creativity stimuli, with the aim of generating solutions for the requirements defined in the Analysis phase, so that they are in accordance with the context and expectations of the software/app user ( see figure below).
pt: Descrição: Esta fase visa gerar ideias por meio de estímulos à criatividade, com o objetivo de gerar soluções para os requisitos definidos na fase de Análise, de forma que estejam de acordo com o contexto e expectativas do usuário do software/app (ver figura abaixo).

# ideation3
source: Inputs: the Initial List of Requirements/Restrictions, the Empathy Map and the Personas;
pt: Inputs: a Lista Inicial de Requisitos/Restrições, o Mapa de Empatia e as Personas;

# ideation4
source: Outputs (artifacts): Updated List of Complete Interface Requirements/Scenarios;
pt: Saídas (artefatos): Lista atualizada de requisitos/cenários completos de interface;

# ideation5
source: Activities: Define Requirement Items/Constraints, Specify Requirement Items, and Generate/Refine Interface Ideas;
pt: Atividades: Definir Itens/Restrições de Requisito, Especificar Itens de Requisito e Gerar/Refinar Ideias de Interface;

# ideation6
source: Involveds: Applicants, Caregivers, Therapists and Designers/Developers.
pt: Envolvidos: Candidatos, Cuidadores, Terapeutas e Designers/Desenvolvedores.

# ideation7
source: Details of the Ideation Phase Activities
pt: Detalhes das Atividades da Fase de Ideação

# ideation8
source: Define Requirements/Restrictions Items
pt: Definir itens de requisitos/restrições

# ideation9
source: The objective of this activity is to identify a set of interface interaction scenarios for each listed requirement item. These scenarios represent the specification of how the requirement can be presented in the interface. Considering that ProAut is User-Centered, and makes use of the Participatory approach, it is suggested the use of the brainstorming technique, and that it be carried out with the collaboration of those involved (parents/mothers, specialists and the applicant), in addition to of the designer and developers.
pt: O objetivo desta atividade é identificar um conjunto de cenários de interação de interface para cada item de requisito listado. Esses cenários representam a especificação de como o requisito pode ser apresentado na interface. Considerando que o ProAut é Centrado no Usuário, e faz uso da abordagem Participativa, sugere-se o uso da técnica de brainstorming, e que seja realizado com a colaboração dos envolvidos (pais/mães, especialistas e o solicitante), em além do designer e desenvolvedores.

# ideation10
source: This activity has 2 sub-activities: Define scenarios and define main and complementary elements of the interface. Below is a suggestion for conducting this activity:
pt: Esta atividade tem 2 sub-atividades: Definir cenários e definir elementos principais e complementares da interface. Segue abaixo uma sugestão para a realização desta atividade:

# ideation11
source: Suggested Procedures:
pt: Procedimentos Sugeridos:

# ideation12
source: 1. Book the brainstorming session, preferably with the designers/developers, applicant, a specialist and at least one parent; 2. Choose a session moderator, who may be a member of the development team (for example, the designer); 3. Book the brainstorming session, preferably with the designers/developers, applicant, a specialist and a parent, at least; 4. Choose a session moderator, who may be a member of the development team (for example, the designer); 5. Define the discussion time for each requirement item or for the session as a whole; 6. Start the session, with the moderator giving a brief explanation of how the session will be conducted, as well as the meaning of more technical terms (requirement, Persona, Empathy Map, brainstorming, among others) that may be necessary for a better understanding of the participants; 7. The moderator must present the initial list of requirements raised/identified in the analysis phase; It is 8. The moderator should present the Personas and Empathy Map (or distribute a copy of the personas and empathy map to each participant) so that everyone has the profile of the future user in mind;
pt: 1. Marcar a sessão de brainstorming, preferencialmente com os designers/desenvolvedores, candidato, um especialista e pelo menos um dos pais; 2. Escolha um moderador da sessão, que pode ser um membro da equipe de desenvolvimento (por exemplo, o designer); 3. Marque a sessão de brainstorming, preferencialmente com os designers/desenvolvedores, candidato, um especialista e um pai, no mínimo; 4. Escolha um moderador de sessão, que pode ser um membro da equipe de desenvolvimento (por exemplo, o designer); 5. Defina o tempo de discussão para cada item do requisito ou para a sessão como um todo; 6. Inicie a sessão, com o moderador dando uma breve explicação de como a sessão será conduzida, bem como o significado de termos mais técnicos (requisito, Persona, Mapa de Empatia, brainstorming, entre outros) que podem ser necessários para uma melhor compreensão do os participantes; 7. O moderador deve apresentar a lista inicial de requisitos levantados/identificados na fase de análise; É 8. O moderador deverá apresentar o Mapa de Personas e Empatia (ou distribuir uma cópia do Mapa de Personas e Empatia para cada participante) para que todos tenham em mente o perfil do futuro usuário;

# ideation13
source: Specify Items Requirements
pt: Especificar requisitos de itens

# ideation14
source: For each requirement item, participants will be able to contribute with suggestions on how the interactions (scenarios) of that requirement will be carried out. For example: In the context of an application to teach spatial notions, the requirement “Show left/right concept”, the following idea may arise for an interaction scenario: Introduce the concept of laterality, having a person in the center of the screen as a reference. Show the words left and right next to the person while the person raises their left and right arm accordingly. earnestly.
pt: Para cada item de requisito, os participantes poderão contribuir com sugestões de como serão realizadas as interações (cenários) daquele requisito. Por exemplo: No contexto de um aplicativo para ensinar noções espaciais, o requisito “Mostrar conceito esquerda/direita”, pode surgir a seguinte ideia para um cenário de interação: Introduzir o conceito de lateralidade, tendo uma pessoa no centro da tela como uma referência. Mostre as palavras esquerda e direita ao lado da pessoa enquanto a pessoa levanta o braço esquerdo e direito de acordo. sinceramente.

# ideation15
source: Taking care of the mirror vision (left of the screen and the left of those facing the screen, for example). Present a soft voice (persona preference) speaking the words left right. During the brainstorming session, new requirements not identified in the previous phase may arise. If this occurs and the applicant is participating in the brainstorming session, he may be asked to validate the need for the new requirement(s) identified, otherwise he may be asked at another previously scheduled time.
pt: Cuidar da visão espelhada (esquerda da tela e esquerda de quem está de frente para a tela, por exemplo). Apresente uma voz suave (preferência de persona) falando as palavras da esquerda para a direita. Durante a sessão de brainstorming, podem surgir novos requisitos não identificados na fase anterior. Caso isso ocorra e o solicitante esteja participando do brainstorming, poderá ser solicitado a validar a necessidade do(s) novo(s) requisito(s) identificado(s), caso contrário poderá ser solicitado em outro horário previamente agendado.

# ideation16
source: Generate/Refine Interface Ideas
pt: Gerar/Refinar Ideias de Interface

# ideation17
source: The objective of this activity is to choose, among the suggested ideas, those that will effectively compose the application. For this purpose, the use of the menu of ideas technique is suggested. It should be noted that, if there is enough time, this activity can be carried out right after the brainstorming session.
pt: O objetivo desta atividade é escolher, dentre as ideias sugeridas, aquelas que irão efetivamente compor o aplicativo. Para tanto, sugere-se a utilização da técnica do menu de ideias. Vale ressaltar que, havendo tempo suficiente, esta atividade pode ser realizada logo após a sessão de brainstorming.

# ideation18
source: Suggested Procedures:
pt: Procedimentos Sugeridos:

# ideation19
source: 1. If it is held right after the brainstorming session, remain with the same moderator as the previous activity, or select another one; 2. The moderator should distribute copies of the menu of ideas (list of ideas); 3. Define the number of ideas to be selected; 4. Depending on the number of ideas, ask each participant to choose a certain number of ideas. This can be agreed between the participants. The greater the number of ideas, the greater the number of choices. For example, if the list has 10 ideas, each participant can be asked to choose up to 4 ideas, but this will depend on the agreement reached between the participants; 5. After the selections, the mediator must list the most voted ideas. In case of a tie, it is suggested to discuss whether the tied ideas should be used, or if only one of them. In the latter case, discuss with the participants the best option for the project.
pt: 1. Caso seja realizado logo após a sessão de brainstorming, permaneça com o mesmo moderador da atividade anterior, ou selecione outro; 2. O moderador deverá distribuir cópias do menu de ideias (lista de ideias); 3. Defina o número de ideias a serem selecionadas; 4. Dependendo do número de ideias, peça a cada participante para escolher um determinado número de ideias. Isso pode ser acordado entre os participantes. Quanto maior o número de ideias, maior o número de escolhas. Por exemplo, se a lista tiver 10 ideias, cada participante poderá ser solicitado a escolher até 4 ideias, mas isso dependerá do acordo alcançado entre os participantes; 5. Após as seleções, o mediador deve listar as ideias mais votadas. Em caso de empate, sugere-se discutir se as ideias empatadas devem ser utilizadas ou apenas uma delas. Neste último caso, discuta com os participantes a melhor opção para o projeto.

# ideation20
source: Another way of conducting the idea menu technique is to list the requirements with the respective scenario ideas suggested on a blackboard, asking each participant to make their choices. For each idea to vote put, for example, the value 1 and at the end compute the total number of votes for each idea and take the most voted (according to what was previously defined by the participants). It is important to emphasize that the scenario ideas must be aligned with the profiles defined by the Personas and/or empathy map. If you prefer, the team can use other techniques (instead of the Ideas Menu).
pt: Outra forma de conduzir a técnica do menu de ideias é listar os requisitos com as respectivas ideias de cenário sugeridas em uma lousa, solicitando que cada participante faça suas escolhas. Para cada ideia a votar coloque, por exemplo, o valor 1 e no final calcule o número total de votos de cada ideia e tire a mais votada (conforme o que foi previamente definido pelos participantes). É importante ressaltar que as ideias de cenário devem estar alinhadas com os perfis definidos pelas Personas e/ou mapa de empatia. Se preferir, a equipe pode utilizar outras técnicas (ao invés do Menu Ideias).

# ideation21
source: Among them is the Positioning Matrix which, in addition to the Personas, also uses guiding criteria, which can be represented by the restrictions identified in the analysis phase. After such analysis and selection, the main and complementary elements of the selected interaction scenarios are defined. These elements correspond to a breakdown of how the elements that make up the scenario must be presented in the interface to be developed. That is, if the description of the selected scenario mentions an object, in this activity you must define the object (as the main one) and the color or shape of the object (as a complementary one).
pt: Entre eles está a Matriz de Posicionamento que, além das Personas, também utiliza critérios norteadores, que podem ser representados pelas restrições identificadas na fase de análise. Após esta análise e seleção, são definidos os elementos principais e complementares dos cenários de interação selecionados. Esses elementos correspondem a um detalhamento de como os elementos que compõem o cenário devem ser apresentados na interface a ser desenvolvida. Ou seja, se a descrição do cenário selecionado menciona um objeto, nesta atividade você deve definir o objeto (como principal) e a cor ou forma do objeto (como complementar).

# ideation22
source: As a result of this activity, the list of interface requirements/scenarios must be completed. To this end, a new “round” of brainstorming is suggested, which could be on the same day as activity 3.2.1 or on another day previously agreed with the participants. Figure 19 presents a complete example of completing the Interface Requirements/Restrictions List, whose context is an App for teaching spatial notions and laterality. Below are the suggested procedures for carrying out this activity.
pt: Como resultado desta atividade, a lista de requisitos/cenários de interface deve ser concluída. Para tanto, sugere-se uma nova “rodada” de brainstorming, que pode ser no mesmo dia da atividade 3.2.1 ou em outro dia previamente combinado com os participantes. A Figura 19 apresenta um exemplo completo de preenchimento da Lista de Requisitos/Restrições de Interface, cujo contexto é um App para ensino de noções espaciais e lateralidade. Abaixo estão os procedimentos sugeridos para a realização desta atividade.

# ideation23
source: Suggested Procedures:
pt: Procedimentos Sugeridos:

# ideation24
source: Choose a moderator, which may be the same as for previous activities. The moderator should present on a blackboard or in printed form, the list of interface scenarios selected in the previous activity, as well as the Personas and the Empathy Map; From each scenario presented, participants will be able to identify the main and complementary elements of the interface scenario.
pt: Escolha um moderador, que pode ser o mesmo das atividades anteriores. O moderador deverá apresentar em quadro ou impresso, a lista de cenários de interface selecionados na atividade anterior, bem como as Personas e o Mapa de Empatia; A partir de cada cenário apresentado, os participantes poderão identificar os elementos principais e complementares do cenário de interface.

# ideation25
source: The GuideAut repository can be consulted to be consulted, in order to help define colors, shapes and other details; If more than one suggestion is obtained for each scenario, a “round” of the menu of ideas (or another preferred technique) must be carried out to select the ideas that will make up the project.
pt: O repositório GuideAut pode ser consultado para ser consultado, de forma a ajudar a definir cores, formas e outros detalhes; Caso seja obtida mais de uma sugestão para cada cenário, deve ser realizada uma “rodada” do cardápio de ideias (ou outra técnica preferida) para selecionar as ideias que irão compor o projeto.

# immersion
source: Overview
pt: Visão Geral

# immersion1
source: The immersion phase is the phase characterized by approaching the problem. It is at this stage that the team seeks to learn about concepts that permeate the theme of the App to be designed. To obtain these inputs, various types of research are carried out, such as interviews, trend searches and direct observation.
pt: A fase de imersão é a fase caracterizada pela abordagem do problema. É nessa etapa que a equipe busca conhecer conceitos que permeiam o tema do App a ser projetado. Para obter esses insumos, vários tipos de pesquisa são realizados, como entrevistas, pesquisas de tendências e observação direta.

# immersion2
source: Phase input: the application idea or overview; Phase output: CCA (Autistic Caregivers Canvas); CTA (Canvas of Autistic Therapists); CSS (Software Requestor Canvas); Autistic Characterization Form answered; and VGA (Autistic Overview Chart); Involved: Parents, specialists, software requester, Designers/developers; Phase Activities: Learn about the context, Elicit Requirements and Consolidate Data, represented and detailed below.
pt: Entrada da fase: a ideia ou visão geral do aplicativo; Saída da fase: CCA (Autistic Caregivers Canvas); CTA (Canvas of Autistic Therapists); CSS (Software Requestor Canvas); Formulário de Caracterização do Autista respondido; e VGA (Gráfico de Visão Geral do Autista ); Envolvidos: Pais, especialistas, solicitante de software, Designers/desenvolvedores; Atividades da Fase: Conhecer o contexto, Elicitar Requisitos e Consolidar Dados, representados e detalhados a seguir.

# immersion3
source: Immersion phase activities
pt: Atividades da fase de imersão

# immersion4
source: Learn about the context
pt: Aprenda sobre o contexto

# immersion5
source: As the name implies, at this stage the designer/team must seek information both about autism and its relationship with the context of the App (which we call the theme here), called the Research Desk. With a user-centered focus, this context also concerns studying and understanding the characteristics of the autistic, and how these characteristics influence the actions to be taken to design the desired interface. Figure 5 presents a diagram with an overview of this activity and its sub-activities.
pt: Como o próprio nome já diz, nessa etapa o designer/equipe deve buscar informações tanto sobre o autismo quanto sua relação com o contexto do App (que aqui denominamos o tema), chamado de Research Desk. Com foco centrado no usuário, esse contexto também diz respeito a estudar e entender as características do autista, e como essas características influenciam nas ações a serem tomadas para projetar a interface desejada. A Figura 5 apresenta um diagrama com uma visão geral desta atividade e suas sub-atividades.

# immersion6
source: Procedural suggestions
pt: Sugestões de procedimento:

# immersion7
source: 1. Elaborate the search items (Based on the overview of the application), that is, terms and/or keywords to be used in the desk search that are related to Autism. TIP: If the designer/team does not have any affinity with the Autism theme, it is suggested that the following be included: Concept of autism, levels of autism, forms of communication of an autistic person, main characteristics and limitations of an autistic person, action/reaction of the autistic in relation to the context of the application;
pt: 1. Elaborar os itens de busca (com base na visão geral do aplicativo), ou seja, termos e/ou palavras-chave a serem utilizados na pesquisa documental que estejam relacionados ao Autismo. DICA: Caso o designer/equipe não tenha afinidade com o tema Autismo, sugere-se que inclua: Conceito de autismo, níveis de autismo, formas de comunicação de um autista, principais características e limitações de um autista , ação/reação do autista em relação ao contexto do aplicativo;

# immersion8
source: 2. Define terms and words that conform to the context of an application. For example, assuming the context of an App to teach laterality (right and left sides), then one should seek information on how the autistic person understands what the right and left side is, what are the main difficulties that an autistic person has to understand what it is left and right side. TIP: In general, regardless of the topic, it is suggested that you always look for questions about what the autistic person likes and dislikes in relation to the proposed topic, what are their difficulties in relation to the proposed topic (app context); and, finally, what types of solutions (other apps for example) already exist for the topic in question, and if this solution has any relation;
pt: 2. Defina termos e palavras que estejam de acordo com o contexto de um aplicativo. Por exemplo, assumindo o contexto de um App para ensinar lateralidade (lado direito e esquerdo), então deve-se buscar informações sobre como o autista entende o que é lado direito e esquerdo, quais são as principais dificuldades que um autista tem para entender o que é lado esquerdo e direito. DICA: De maneira geral, independente do tema, sugere-se que você sempre busque perguntas sobre o que o autista gosta e não gosta em relação ao tema proposto, quais são suas dificuldades em relação ao tema proposto (contexto do app); e, por fim, que tipos de soluções (outros apps por exemplo) já existem para o tema em questão, e se essa solução tem alguma relação;

# immersion9
source: 3. Define the search sources (books, websites, videos, magazines, blogs of parents and/or specialists in autism, related articles, etc.); Run the search. TIP: Write down the results of the searches in handwritten or typed form, including the source data for a possible need to consult again. For that, something like the example below is suggested.
pt: 3. Definir as fontes de busca (livros, sites, vídeos, revistas, blogs de pais e/ou especialistas em autismo, artigos relacionados, etc.); Execute a pesquisa. DICA: Anote os resultados das buscas de forma manuscrita ou digitada, incluindo os dados de origem para uma eventual necessidade de nova consulta. Para isso, sugere-se algo como o exemplo abaixo.

# immersion10
source: Elicit from requirements
pt: Extrair dos requisitos
