Repository: diegomlopes/guideaut
Catalog: lib/l10n/app_*.arb
Languages: pt

# title
source: My App
pt: Meu App

# greeting
source: Hello!
pt: Olá!

# welcome
source: Welcome to my app.
pt: Bem-vindo ao meu app.

source: SIGN IN
pt: ENTRAR

source: HOME
pt: INÍCIO

source: TOOLS
pt: FERRAMENTAS

source: ABOUT
pt: SOBRE

source: CONTACT
pt: CONTATO

source: ProAut Tutorial
pt: Tutorial do ProAut

source: ProAut Artifacts
pt: Artefatos do ProAut

source: Look For Recomendations
pt: Buscar por Recomendações

source: New Project
pt: Novo Projeto

# guideAut_desc_1
source: GuideAut was conceived to provide technological support to ProAut,
pt: GuideAut foi concebido para fornecer suporte tecnológico ao ProAut,

# guideAut_desc_2
source: a process to support the development of application interfaces for
pt: um processo para apoiar o desenvolvimento de interfaces de aplicativos para

# guideAut_desc_3
source: autistic people. GuideAut contains collaborative system properties,
pt: pessoas autistas. GuideAut contém propriedades de sistema colaborativo,

# guideAut_desc_4
source: design recommendations for graphical interfaces that make applications
pt: recomendações de design para interfaces gráficas que fazem aplicações

# guideAut_desc_5
source: more attractive to such an audience, as well as specific characteristics
pt: mais atraente para tal público, bem como características específicas

# guideAut_desc_6
source: of autistic profiles to help generate empathy between autistics and the
pt: de perfis autistas para ajudar a gerar empatia entre autistas e os

# guideAut_desc_7
source: development team, through the use of of ProAut artifacts.
pt: equipe de desenvolvimento, através do uso de artefatos ProAut.

source: The GuideAut
pt: O GuideAut

source: Search for Recomendations
pt: Busque por Recomendações

source: Sign In
pt: Entrar

source: User not found!
pt: Usuário não encontrado!

source: Confirm
pt: Confirmar

source: Password
pt: Senha

source: New user? Register.
pt: Novo usuário? Cadastre-se.

source: Forgot password?
pt: Esqueceu a senha?

source: New User
pt: Novo Usuário

source: Invalid E-mail!
pt: E-mail inválido!

source: Invalid Password!
pt: Senha inválida!

# diferent_passwords
source: Confirm Password is Not Equals to Password!
pt: Senha de Confirmação não é igual a senha informada!

# enter_contact
source: Contact
pt: Entre em Contato

source: Name
pt: Nome

# enter_name
source: Type your name
pt: Digite seu nome

# enter_email
source: Type your e-mail
pt: Digite seu e-mail

source: Message
pt: Messagem

# enter_message
source: Type your message
pt: Digite sua mensagem

source: Send
pt: Enviar

# about_guideaut
source: About the GuideAut
pt: Sobre o GuideAut

# about1
source: Guideaut is the result of a series of scientific works developed by students of computing courses at the University of the State of Amazonas (UEA). All of its features were designed to meet the entire ProAut process, which is a specific process for developing application interfaces aimed at the autistic public. This process was also the result of extensive research by Prof. Dr. Aurea Melo.
pt: O Guideaut é resultado de uma série de trabalhos científicos desenvolvidos por alunos dos cursos de computação da Universidade do Estado do Amazonas (UEA). Todas as suas funcionalidades foram pensadas para atender todo o processo do ProAut, que é um processo específico para desenvolvimento de interfaces de aplicações voltadas para o público autista. Tal processo foi resultado, também, de uma ampla pesquisa da Prof. Dr. Aurea Melo.

source: Current Features
pt: Funcionalidades Atuais

# features1
source: ProAut Tutorial Search for Recommendations Admin Panel
pt: Tutorial do ProAut Busca por Recomendações Painel Administrativo

source: Version
pt: Versão

source: The ProAut
pt: O ProAut

source: Results for:
pt: Resultados para:

source: Mark
pt: Nota

source: Ratings
pt: Avaliações

source: Users
pt: Usuários

source: My Recomendations
pt: Minhas Recomendações

source: My Projects
pt: Meus Projetos

source: Logout
pt: Sair

source: User Recomendations
pt: Recomendações do Usuário

source: User Projects
pt: Projetos do Usuário

source: Admin Panel
pt: Painel Administrativo

# tutorial1
source: ProAut is a process designed to support Application Interface projects for autistic people. Its focus is mainly lay designers and/or developers
pt: O ProAut é um processo desenvolvido para dar suporte a projetos de Interface de Aplicações para pessoas autistas. Seu foco é principalmente designers leigos e/ou desenvolvedores

# tutorial2
source: 'ProAut is responsible for 4 Steps (as shown below) motivated by Design Thinking: Immersion, Analysis, Ideation and Prototyping;
pt: A ProAut é responsável por 4 Etapas (conforme abaixo) motivadas pelo Design Thinking: Imersão, Análise, Ideação e Prototipagem;

# tutorial3
source: Each stage has activities and generates a set of sanitary valves that serve as inputs for the subsequent stage; ProAut does not claim to support interface design per se. Its stages and respective activities are exclusively proposed to assist in conducting the process of creating interfaces, providing techniques for carrying out these activities, in order to provide, for example, the understanding of the autism theme (desk research), the survey of requirements (interviews), the generation of empathy with autistic people (PersonAut and EmpathyAut), as well as the details of the scenarios that will allow the design of the interface (list of requirements and scenarios).
pt: Cada etapa possui atividades e gera um conjunto de válvulas sanitárias que servem de insumos para a etapa seguinte; O ProAut não afirma oferecer suporte ao design de interface per se. Suas etapas e respectivas atividades são propostas exclusivamente para auxiliar na condução do processo de criação de interfaces, fornecendo técnicas para a realização dessas atividades, a fim de proporcionar, por exemplo, o entendimento do tema autismo (desk research), o levantamento de requisitos ( entrevistas), a geração de empatia com pessoas autistas (PersonAut e EmpathyAut), bem como o detalhamento dos cenários que permitirão o desenho da interface (lista de requisitos e cenários).

# tutorial4
source: ProAut does not claim to support interface design per se. Its stages and respective activities are exclusively proposed to assist in conducting the process of creating interfaces, providing techniques for carrying out these activities, in order to provide, for example, the understanding of the autism theme (desk research), the survey of requirements (interviews), the generation of empathy with autistic people (PersonAut and EmpathyAut), as well as the details of the scenarios that will allow the design of the interface (list of requirements and scenarios).
pt: O ProAut não afirma oferecer suporte ao design de interface per se. Suas etapas e respectivas atividades são propostas exclusivamente para auxiliar na condução do processo de criação de interfaces, fornecendo técnicas para a realização dessas atividades, a fim de proporcionar, por exemplo, o entendimento do tema autismo (desk research), o levantamento de requisitos ( entrevistas), a geração de empatia com pessoas autistas (PersonAut e EmpathyAut), bem como o detalhamento dos cenários que permitirão o desenho da interface (lista de requisitos e cenários).

source: Immersion Phase
pt: Fase de Imersão

source: Analysis Phase
pt: Fase de Análise

source: Ideation Phase
pt: Fase de Ideação

source: Prototyping Phase
pt: Fase de Prototipação

# see_to
source: See too:
pt: Veja também:

# prototyping1
source: Prototyping this is the step in which the 1st version of the prototype should effectively be developed. To do so, the development team (designers/developers) must adopt the interactions and requirements contained in the lists of requirements/restrictions. In addition to the elements contained in this list, the team can also consult GuideAut for any suggestions on some characteristics to be observed in relation to the elements. For example, regarding colors and geometric shapes. The result of this step consists of a prototype to be evaluated in the next step.
pt: Prototipagem esta é a etapa em que a 1ª versão do protótipo deve ser efetivamente desenvolvida. Para tanto, a equipe de desenvolvimento (designers/desenvolvedores) deve adotar as interações e requisitos contidos nas listas de requisitos/restrições. Além dos elementos contidos nesta lista, a equipe também pode consultar o GuideAut para sugestões sobre algumas características a serem observadas em relação aos elementos. Por exemplo, em relação a cores e formas geométricas. O resultado desta etapa consiste em um protótipo a ser avaliado na etapa seguinte.

# prototyping2
source: Suggested Procedures:
pt: Procedimentos Sugeridos:

# prototyping3
source: Make the prototype based mainly on 6 and 7 (main interface elements and complementary interface elements respectively).
pt: Faça o protótipo baseado principalmente em 6 e 7 (elementos principais da interface e elementos complementares da interface, respectivamente).

# prototyping4
source: After manufacturing, the prototype is evaluated. To do so, the team will be able to use techniques already consolidated in the area of Software Engineering. However, it suggests some items to be observed regarding the user. For example, check who will be the main application user. Whether the specialist will be the parents or the autistic. Depending on who will be the main user, traditional techniques must be observed for each type of user. If you are autistic, search, for example, on GuideAut for some suggestions for carrying out the assessment.
pt: Após a fabricação, o protótipo é avaliado. Para tanto, a equipe poderá utilizar técnicas já consolidadas na área de Engenharia de Software. No entanto, sugere alguns itens a serem observados em relação ao usuário. Por exemplo, verifique quem será o usuário principal do aplicativo. Se o especialista serão os pais ou o autista. Dependendo de quem será o usuário principal, técnicas tradicionais devem ser observadas para cada tipo de usuário. Se você é autista, procure, por exemplo, no GuideAut algumas sugestões para a realização da avaliação.

# prototyping5
source: Ao final desta etapa, a eeuipe deve considerar e avaliar todas as sugestões de melhoria, refinar o protótipo e reavaliar até que esteja em uma versão satisfatória. Em seguida, o protótipo poderá estar disponível para desenvolvimento da aplicação em si.
pt: Ao final desta etapa, a equipe deve considerar e avaliar todas as sugestões de melhoria, refinar o protótipo e reavaliar até que esteja em uma versão satisfatória. Em seguida, o protótipo poderá estar disponível para o desenvolvimento da aplicação em si.

# analysis1
source: The Analysis phase is characterized by approaching the problem, in which the team dives into all the information obtained in the previous phase, evaluates the implications of the challenge from the point of view of the various stakeholders, and initiates the main solution proposals.
pt: A fase de Análise caracteriza-se pela abordagem do problema, em que a equipa mergulha em toda a informação obtida na fase anterior, avalia as implicações do desafio do ponto de vista dos vários stakeholders e inicia as principais propostas de solução.

# analysis2
source: It is basically composed of 3 activities: Triangular Data, Generate Empathy Map and Generate Personas. Emphasizing that the last two have the same objective, which is the generation of empathy between the designer and the autistic. However, in ProAut, the designer can choose the one that most identifies with him or both, if he prefers, since they are generally used in a complementary way. Figure 12 presents the overview of this phase.
pt: É composto basicamente por 3 atividades: Dados Triangulares, Gerar Mapa de Empatia e Gerar Personas. Ressaltando que os dois últimos possuem o mesmo objetivo, que é a geração de empatia entre o designer e o autista. Porém, no ProAut, o designer pode escolher aquele que mais se identifica com ele ou os dois, se preferir, já que geralmente são usados de forma complementar. A Figura 12 apresenta a visão geral desta fase.

# analysis3
source: Inputs: the Caregivers, Therapist and Requester Canvas; the completed FCA's and their respective Autistic Overview Charts (VGA);
pt: Entradas: o Canvas de Cuidadores, Terapeuta e Solicitante; os FCA's preenchidos e seus respectivos Autistic Overview Charts (VGA);

# analysis4
source: Outputs (artifacts): Initial List of Requirements/Constraints, Personas, Empathy Map;
pt: Saídas (artefatos): Lista Inicial de Requisitos/Restrições, Personas, Mapa de Empatia;

# analysis5
source: Activities: Triangular Data; Generate Empathy Map (EmpathyAut); Generate Personas (PersonAut);
pt: Atividades: Dados Triangulares; Gerar Mapa de Empatia (EmpathyAut); Gerar Personas (PersonAut);

# analysis6
source: Involveds: Designers/Developers
pt: Envolvidos: Designers/Desenvolvedores

# analysis7
source: Details of the Analysis Phase Activities
pt: Detalhes das Atividades da Fase de Análise

# analysis8
source: Triangular Data
pt: Triangular Dados

# analysis9
source: In this activity, you must use the multiple sources of data (the different Canvas) generated in the immersion phase, and perform an analysis of the compatible sections in order to design an initial list of requirements/restrictions (figure below). Such a list is obtained not only by what the requester himself wants, but also by crossing information contained in the Canvas of parents and specialists.
pt: Nesta atividade, você deve usar as múltiplas fontes de dados (os diferentes Canvas) geradas na fase de imersão e realizar uma análise das seções compatíveis para desenhar uma lista inicial de requisitos/restrições (figura abaixo). Tal lista é obtida não apenas pelo que o próprio solicitante deseja, mas também pelo cruzamento de informações contidas no Canvas de pais e especialistas. Dados

# analysis10
source: In addition, the name initial list is due to the fact that in this phase only the first 4 columns are filled in (the rest will be filled in in the next step). The content of the Requirement Items column must contain the details of each requirement identified in the Requirement column. That is, a requirement can give rise to multiple requirement items. As for the ID column, this must represent the unique identification of the requirement, starting with the letters RQ to represent a requirement, and RT for a restriction followed by a sequential number (which can be two digits. Example: RQ01 for requirement 1, and RT01 for constraint 01. The column RQ can be filled with the value RQ for requirement and RT for constraint.
pt: Além disso, o nome lista inicial se deve ao fato de que nesta fase apenas as 4 primeiras colunas são preenchidas (as demais serão preenchidas na próxima etapa). O conteúdo da coluna Itens de Requisito deve conter os detalhes de cada requisito identificado na coluna Requisito. Ou seja, um requisito pode dar origem a vários itens de requisito. Já a coluna ID, esta deve representar a identificação única do requisito, iniciando com as letras RQ para representar um requisito, e RT para uma restrição seguida de um número sequencial (que pode ser de dois dígitos. Exemplo: RQ01 para requisito 1, e RT01 para restrição 01. A coluna RQ pode ser preenchida com o valor RQ para requisito e RT para restrição.

# analysis11
source: Below is a suggestion for conducting the analysis of the data contained in the Canvas sections, in order to generate the initial list of requirements/restrictions:
pt: Segue abaixo uma sugestão para realizar a análise dos dados contidos nas seções do Canvas, a fim de gerar a lista inicial de requisitos/restrições:

# analysis12
source: Procedure Suggestion:
pt: Sugestão de procedimento:

# analysis13
source: 1. Analyze sections 5 (Recommended Activities in relation to the topic),6 (Restrictive Activities in relation to the software), and 7c (Notes regarding the Sw/App) of the CTA (Specilist); 2. Review sections 4(Indicated Activities), 5(Non-Indicated Activities) and 7 (Requirements) of the CSS (Applicant).
pt: 1. Analisar as seções 5 (Atividades Recomendadas em relação ao tema),6 (Atividades Restritivas em relação ao software) e 7c (Notas sobre o Sw/App) do CTA (Especialista); 2. Revise as seções 4(Atividades indicadas), 5(Atividades não indicadas) e 7 (Requisitos) do CSS (Requerente).

# analysis14
source: Generate Personas
pt: Gerar Personas

# analysis15
source: In this activity, personas (PersonAut) must be generated that will be objects of empathy generation in the next phase (ideation). Each persona must correspond to an FCA. ProAut has 2 templates for Personas. Figure 14 shows an instantiated example of Model 1.
pt: Nesta atividade devem ser geradas personas (PersonAut) que serão objetos de geração de empatia na fase seguinte (ideação). Cada persona deve corresponder a uma FCA. A ProAut possui 2 templates para Personas. A Figura 14 mostra um exemplo instanciado do Modelo 1.

# analysis16
source: Procedure for Model 1:
pt: Procedimento para o Modelo 1:

# analysis17
source: 1. From the Canvases of Parents and Experts, transcribe the sections Activities that Calm Down, Stereotypies/Manias and Activities that Stress respectively to the sections Activities that Calm Down, Stereotypies/Manias and Activities that Stress in PersonAut; 2. For Parent Canvas only, transcribe the Social and Family Aspects section to the section of the same name in the Persona Template; 3. If there are conflicting instances, that is, instances of different sections in the Parents and Experts Canvases with the same value (for example a certain activity belongs to the Stressful Activities section in a canvas, and this same activity appears with the calming activity in the other), one must analyze and choose one of them to compose the respective section of PersonAut; 4. In the PersonAut Demographic Characteristics section do the following: 5. “Name” field: Give a fictitious name for the persona; 6. “Age” field: choose an age within the age range defined in the profile section of the Parents or Experts Canvas; It is 7. “Genre” field: define a Genre 8. In the General Characteristics section of the Persona Canvas, do the following: 9. In the field “Language:” enter one of the following options: verbal, non-verbal, echolalic verbal 10. “Sensitivity to Sound” field: Enter according to the response to one of items 28 and 29 of the FCA (28- Exaggerated reaction to auditory stimuli; 29- Hypo-reaction to auditory stimuli). That is, the one that is marked as 1. 11. Field “Level of Autism” – enter as defined in the Profile section of the APC (mild, moderate or severe). 12. Insert the VGA graphic generated by the electronic FCA. 13. Finally, insert a fictitious photo or a face drawing to compose the Persona image.
pt: 1. Das Telas de Pais e Especialistas, transcreva as seções Atividades que Acalmam, Estereotipias/Manias e Atividades que Estressam, respectivamente, para as seções Atividades que Acalmam, Estereotipias/Manias e Atividades que Estressam na PessoaAut; 2. Somente para a Tela principal, transcreva a seção Aspectos sociais e familiares para a seção de mesmo nome no Modelo de persona; 3. Se houver instâncias conflitantes, ou seja, instâncias de seções diferentes nas telas Pais e Especialistas com o mesmo valor (por exemplo, uma determinada atividade pertence à seção Atividades estressantes em uma tela e essa mesma atividade aparece com a atividade calmante na tela outro), deve-se analisar e escolher um deles para compor a respectiva seção do PersonAut; 4. Na seção PersonAut Demographic Characteristics, faça o seguinte: 5. Campo “Nome”: Dê um nome fictício para a persona; 6. Campo “Idade”: escolha uma idade dentro da faixa etária definida na seção de perfil da Tela de Pais ou Especialistas; É 7. Campo “Gênero”: defina um Gênero 8. Na seção General Characteristics do Persona Canvas, faça o seguinte: 9. No campo “Idioma:” digite uma das seguintes opções: verbal, não verbal, ecolálico verbal 10. Campo “Sensibilidade ao Som”: Preencha de acordo com a resposta a um dos itens 28 e 29 do FCA (28- Reação exagerada a estímulos auditivos; 29- Hipo-reação a estímulos auditivos). Ou seja, aquele que está marcado como 1. 11. Campo “Nível de Autismo” – insira conforme definido na seção Perfil do APC (leve, moderado ou grave). 12. Insira o gráfico VGA gerado pelo FCA eletrônico. 13. Por fim, insira uma foto fictícia ou um desenho de rosto para compor a imagem da Persona.

# analysis18
source: Generate Empathy Map
pt: Gerar mapa de empatia

# analysis19
source: In this activity, another empathy object must also be generated for the ideation phase, which corresponds to an Empathy Map, called EmpathyAut (see Figure 16). EmpathyAut instances are obtained directly from the FCA and from the Requester Canvas (ASRC- Autistic's Software Requester Canvas).
pt: Nesta atividade também deve ser gerado outro objeto de empatia para a fase de ideação, que corresponde a um Mapa de Empatia, denominado EmpathyAut (ver Figura 16). As instâncias EmpathyAut são obtidas diretamente da FCA e do Requester Canvas (ASRC- Autistic's Software Requester Canvas).

# analysis20
source: Procedure Suggestion:
pt: Sugestão de procedimento:

# analysis21
source: 1. Give the persona a fictitious name; 2. Enter an age between the age range defined in the ARC profile; 3. Transcribe each characteristic marked with the value 1 in the AFC, to the corresponding category (of the same name) of EmpathyAut. 4. Transcribe the Sound/Noise Sensitivity Level section of EmpathyAut to be instantiated from one of the FCA characteristics 28 and 29 responses (28- Exaggerated reaction to auditory stimuli; 29- Hypo-reaction to auditory stimuli). FCA Behavior category; of one of the items That is, the one marked as 1. 5. Instances of the “Purpose of the Software” section together with the “Public Needs in relation to the topic” section of the ASRC shall compose the “Needs” section; It is 6. Finally, instances of the “Skills to be developed” section must be transcribed for the “Motivations” section.
pt: 1. Dê um nome fictício à persona; 2. Insira uma idade dentro da faixa etária definida no perfil ARC; 3. Transcreva cada característica marcada com o valor 1 no AFC, para a categoria correspondente (de mesmo nome) de EmpathyAut. 4. Transcreva a seção Sound/Noise Sensitivity Level de EmpathyAut para ser instanciada a partir de uma das características FCA 28 e 29 respostas (28- Reação exagerada a estímulos auditivos; 29- Hipo-reação a estímulos auditivos). categoria Comportamento FCA; de um dos itens Ou seja, aquele marcado como 1. 5. Instâncias da seção “Finalidade do Software” juntamente com a seção “Necessidades Públicas em relação ao tema” do ASRC devem compor a seção “Necessidades”; É 6. Por fim, as ocorrências da seção “Competências a serem desenvolvidas” devem ser transcritas para a seção “Motivações”.

# analysis22
source: VGA graphics generation
pt: Geração de gráficos VGA

# analysis23
source: If the FCA has been used in printed form, the responses obtained in the electronic FCA must be transcribed. With this, the VGA graph is automatically generated from filling the FCA in electronic form.
pt: Caso a FCA tenha sido utilizada na forma impressa, as respostas obtidas na FCA eletrônica devem ser transcritas. Com isso, o gráfico VGA é gerado automaticamente a partir do preenchimento da FCA em formato eletrônico.

# analysis24
source: Procedure Suggestion:
pt: Sugestão de procedimento:
