Repository: diegomlopes/guideaut
Catalog: lib/l10n/app_*.arb
Languages: pt

# immersion48
source: Eliminate conflicts – In a given interview, if an answer that conflicts with another interview is obtained, the one with the highest incidence (number of similar ones) should be used. Example: Suppose that in an interview with a certain mother, this one answers that taking a shower is a stressing activity, and in another interview with another mother, this same answer appears as an activity that calms down. In this case, you should evaluate the highest incidence of responses from respondents (other respondents), or simply choose the one that, in your view and/or experience, is more convenient for the section of the canvas.
pt: Eliminar conflitos – Em uma determinada entrevista, se for obtida uma resposta conflitante com outra entrevista, deve-se utilizar aquela de maior incidência (número de semelhantes). Exemplo: Suponha que em uma entrevista com uma determinada mãe, esta responda que tomar banho é uma atividade estressante, e em outra entrevista com outra mãe, esta mesma resposta apareça como uma atividade que acalma. Neste caso, você deve avaliar a maior incidência de respostas dos respondentes (outros respondentes), ou simplesmente escolher aquela que, na sua visão e/ou experiência, é mais conveniente para a seção do canvas.

# immersion49
source: Transferring the FCA to the electronic medium – if it has not been possible to use the FCA in the electronic mode, it must be transferred to that mode, so that it is possible to generate the VGA. OBS: It is important to point out that if it is not possible to carry out interviews with parents or specialists, please consult GuideAut.
pt: Transferindo o FCA para o meio eletrônico – caso não tenha sido possível utilizar o FCA no modo eletrônico, ele deve ser transferido para esse modo, para que seja possível gerar o VGA. OBS: É importante ressaltar que caso não seja possível realizar entrevistas com pais ou especialistas, favor consultar o GuideAut.
